{
  "backend/main.mo": "Main Motoko actor for the BONITARA backend, implementing user registration/login, admin authentication, product management (CRUD), and product reviews with role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting a single high-confidence fix: the 'Add New Product' modal in AdminDashboardPage.tsx was patched to prevent input fields from losing focus on each keystroke by lifting ProductForm outside the parent component.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-sentence summaries of all frontend source files, serving as a reference index for the pages and components in the project.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, mounting the React root into a div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up CartContext and WishlistContext providers, implements a hash-based client-side router, and renders the Header, Footer, and all page components based on the current URL hash.",
  "frontend/src/components/Footer.tsx": "Site footer component rendering a four-column grid with brand info and social links, quick navigation links, policy links, and account links using hash-based routing.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop/mobile navigation, category dropdown, cart/wishlist icon badges, and Internet Identity authentication (login/logout) with a user menu.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product as a card with image, wishlist toggle, add-to-cart overlay, star rating, price, and stock status; links to the product detail page.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that redirects unauthenticated users to /login and shows a spinner while the Internet Identity session is initializing.",
  "frontend/src/components/ReviewForm.tsx": "Form component for submitting a product review with star rating, author name, optional title, and body; shows success or error states after submission.",
  "frontend/src/components/ReviewsList.tsx": "Fetches and displays a product's reviews with average rating summary, individual review cards, loading skeletons, and an empty state message.",
  "frontend/src/components/StarRating.tsx": "Provides two reusable star components: StarRatingDisplay for read-only star rendering and StarRatingSelector for interactive hover-and-click star selection.",
  "frontend/src/data/products.ts": "Static product catalog defining the Product interface and an array of hardcoded products across four categories (soap-making, candle-making, resin-art, fragrance) with pricing, stock, and metadata.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useManualAuth.ts": "Hook for email/password-based authentication that calls backend actor methods for login and registration, persisting session state in localStorage.",
  "frontend/src/hooks/useProductReviews.ts": "Provides two React Query hooks: one to fetch reviews for a specific product and another to fetch average ratings for all products from the backend actor.",
  "frontend/src/hooks/useSubmitReview.ts": "React Query mutation hook that submits a product review via the backend actor and invalidates related review and rating queries on success.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS with custom OKLCH-based design tokens for light/dark themes, and defines utility classes and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with product management UI, including stat cards, a product list with search, and a modal form for creating and editing products via backend mutations.",
  "frontend/src/pages/BlogListingPage.tsx": "Displays a grid of blog post cards sourced from static data, each linking to an individual blog post page.",
  "frontend/src/pages/BlogPostPage.tsx": "Renders a single blog post page with a hero image, full content, tags, and a 'More from the Journal' related posts section, looking up the post by ID from static data.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart with item list, quantity controls, remove buttons, shipping calculation, and an order summary with a checkout link.",
  "frontend/src/pages/CategoryPage.tsx": "Fetches and displays products for a given category from the backend actor, with sorting and price-range filtering, a category banner image, and a product grid.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page with a shipping address form, payment method selection (Razorpay/Stripe/UPI), order summary, and a simulated order confirmation screen.",
  "frontend/src/pages/ContactPage.tsx": "Contact page showing business info (email, phone, address, hours), social links, a map placeholder, and a contact form with simulated submission and toast notification.",
  "frontend/src/pages/FAQPage.tsx": "Renders a list of 10 hardcoded FAQ items using an accordion component, with a header section and a 'still have questions' call-to-action at the bottom.",
  "frontend/src/pages/HomePage.tsx": "The main landing page featuring a hero slider, category grid, featured products fetched from the backend actor, feature highlights, testimonials carousel, and a newsletter signup section.",
  "frontend/src/pages/LoginPage.tsx": "Login page supporting two authentication methods—email/password (manual) and Internet Identity—with tab switching, form validation, error display, and redirect on successful authentication.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays a user's order history using mock data with status badges (delivered, shipped, processing, cancelled); requires authentication and redirects unauthenticated users to the login page.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page that fetches a single product by ID, displays images, pricing, quantity selector, add-to-cart/wishlist actions, reviews, and related products in a tabbed layout.",
  "frontend/src/pages/ProfilePage.tsx": "Authenticated user profile page that fetches and edits the caller's profile via the backend actor, and includes tabs for profile info, wishlist items, and orders; prompts new users to complete their profile setup.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page with two tabs: email/password manual registration and Internet Identity login. Validates form inputs, calls manualRegister or II login, and redirects to profile on success.",
  "frontend/src/pages/ReturnPolicyPage.tsx": "Static informational page displaying BONITARA's return and refund policy, including eligibility criteria, non-returnable items, damage claims, and refund process.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static informational page outlining BONITARA's shipping policy, covering processing times, delivery timeframes, shipping charges, peak-season delays, and order tracking.",
  "frontend/src/pages/TermsPage.tsx": "Static legal page rendering BONITARA's Terms & Conditions across eight sections including pricing, IP, liability, privacy, and governing law.",
  "frontend/src/pages/WholesalePage.tsx": "Wholesale page displaying bulk pricing tiers, program features, and a contact/inquiry form with simulated submission and toast notification.",
  "frontend/src/pages/WishlistPage.tsx": "React page component that displays the user's wishlist items in a responsive grid, allowing items to be removed or added to the cart, with an empty-state view when no items are saved.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL/hash query parameters, persist them to sessionStorage, and clean sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom design tokens (colors, fonts, shadows, animations) using OKLCH color values, with plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for BONITARA tracking version, existing features, and a known issue where typing in the 'Add New Product' modal causes input fields to lose focus on each keystroke."
}