{
  "backend/main.mo": "Main Motoko actor for the BONITARA backend, handling user registration/login, admin authentication, product management, reviews, and role-based access control using a mixin authorization pattern.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (admin panel link removal, admin login page, admin route protection, and user sign-in/sign-up) to their corresponding source files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON document containing one-sentence summaries of each frontend source file, describing the purpose and key implementation details of every page and component in the project.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom properties for the light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a `#root` div and loading the TypeScript entry point `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that sets up CartContext and WishlistContext providers, implements a hash-based router, and renders all page routes with admin routes served outside the main Header/Footer layout.",
  "frontend/src/components/AdminProtectedRoute.tsx": "Route guard component that checks for an `adminSession` flag in sessionStorage and redirects unauthenticated users to `/admin/login`, showing a spinner while checking.",
  "frontend/src/components/Footer.tsx": "Site footer component rendering brand info, social links, and navigation columns for Quick Links, Policies, and Account using a dark foreground background with ivory text.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop/mobile navigation, category dropdown, cart/wishlist icon badges, and Internet Identity login/logout functionality.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product as a card with image, wishlist toggle, add-to-cart overlay, star rating, price, and stock status.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that redirects unauthenticated users to /login, supporting both Internet Identity and manual auth, with a loading spinner during initialization.",
  "frontend/src/components/ReviewForm.tsx": "Form component for submitting product reviews with star rating, author name, optional title, and body fields, using the useSubmitReview hook.",
  "frontend/src/components/ReviewsList.tsx": "Fetches and displays a product's reviews with average rating summary, individual review cards, loading skeletons, and an empty state.",
  "frontend/src/components/StarRating.tsx": "Provides two reusable star components: StarRatingDisplay for read-only ratings and StarRatingSelector for interactive hover-and-click rating input.",
  "frontend/src/data/products.ts": "Static product catalog defining the Product interface and an array of hardcoded products across four categories (soap-making, candle-making, resin-art, fragrance) with pricing, stock, and metadata.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useManualAuth.ts": "Hook for email/password-based authentication that calls backend actor methods for login, registration, and admin checks, persisting session state in localStorage.",
  "frontend/src/hooks/useProductReviews.ts": "Provides React Query hooks to fetch reviews for a specific product and to fetch average ratings for all products from the backend actor.",
  "frontend/src/hooks/useSubmitReview.ts": "React Query mutation hook that submits a product review via the backend actor and invalidates related review and rating queries on success.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS custom properties for a luxury warm-toned design system with light/dark modes, animations, and custom scrollbar styles.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with product management UI (add, edit, delete, toggle visibility) using React Query mutations and queries against the backend actor, plus stat cards and a search interface.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page with hardcoded credentials that sets a sessionStorage flag on success and redirects to the admin dashboard.",
  "frontend/src/pages/BlogListingPage.tsx": "Renders a grid listing of all blog posts from the static data source, displaying each post's image, category, date, title, and excerpt with a link to the full post.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post by ID with a hero image, full content, tags, and a 'More from the Journal' section showing two related posts.",
  "frontend/src/pages/CartPage.tsx": "Shows the shopping cart with item list, quantity controls, remove buttons, shipping calculation, and an order summary with a checkout link.",
  "frontend/src/pages/CategoryPage.tsx": "Fetches and displays products for a given category from the backend actor, with sorting and price-range filtering controls and a category banner image.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout form collecting shipping address and payment method selection, with a simulated order submission that shows an order-confirmed screen on success.",
  "frontend/src/pages/ContactPage.tsx": "Contact page displaying business info (email, phone, address, hours) and social links alongside a contact form that simulates submission and shows a success toast.",
  "frontend/src/pages/FAQPage.tsx": "Renders a FAQ page for BONITARA with 10 accordion-style Q&A items covering ordering, shipping, wholesale, and policies. Includes a footer prompt to contact support if questions remain unanswered.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring an auto-advancing hero slider, category grid, featured products fetched from the backend actor, feature highlights, testimonials carousel, and a newsletter signup section.",
  "frontend/src/pages/LoginPage.tsx": "Login page that uses Internet Identity for passwordless authentication, redirecting to the profile page on success. Displays both sign-in and sign-up buttons that trigger the same Internet Identity login flow.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays a list of mock past orders with status badges (delivered, shipped, processing, cancelled) for authenticated users. Redirects unauthenticated users to the login page.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page that fetches a single product by ID, displays images, pricing, stock status, quantity selector, add-to-cart and wishlist actions, reviews, and related products. Shows skeleton loaders while data is loading.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile page with tabs for profile info, wishlist, and orders, supporting profile creation and editing via backend mutations.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page supporting both email/password signup and Internet Identity login, with form validation and redirect to profile on success.",
  "frontend/src/pages/ReturnPolicyPage.tsx": "Static page displaying BONITARA's return and refund policy, including eligibility, non-returnable items, damage claims, and refund process.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static page presenting BONITARA's shipping policy covering processing times, delivery timeframes, charges, tracking, and peak season delays.",
  "frontend/src/pages/TermsPage.tsx": "Static page rendering BONITARA's Terms & Conditions across sections covering website use, pricing, IP, liability, privacy, and governing law.",
  "frontend/src/pages/WholesalePage.tsx": "Renders the wholesale/bulk orders page for BONITARA, displaying pricing tiers, feature highlights, and a contact form for wholesale inquiries with simulated submission handling.",
  "frontend/src/pages/WishlistPage.tsx": "Displays the user's saved wishlist items in a product grid with options to remove items or add them to the cart, and shows an empty state when no items are saved.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL/hash query parameters, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (gold, ivory, charcoal), fonts (Cormorant Garamond, Jost), shadows, animations, and plugin setup for typography, container queries, and animate.",
  "project_state.json": "Tracks the project's architectural state, existing implemented features, and pending feature requests, focusing on admin panel security and user authentication via Internet Identity."
}