{
  "backend/main.mo": "Motoko actor that initializes access control state and exposes an `adminCheck` function that traps if the caller lacks admin permission.",
  "feature_evidence.json": "Feature evidence report mapping each product feature (home page, category pages, product detail, cart, checkout, etc.) to their implementing source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to one-line descriptions summarizing the purpose and notable implementation details of each page and component.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the BONITARA React app, mounting the app into a `#root` div and loading the Vite entry module.",
  "frontend/src/App.tsx": "Root React component that sets up CartContext and WishlistContext with localStorage persistence, implements a hash-based router, and renders the appropriate page component alongside Header and Footer.",
  "frontend/src/components/Footer.tsx": "Site footer with brand logo, tagline, social media icons, quick navigation links, policy links, and contact details including email, phone, and address.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop navigation including a categories dropdown, mobile menu toggle, cart badge, wishlist link, and Internet Identity login/logout button.",
  "frontend/src/components/ProductCard.tsx": "A React component that renders a product card with image, category, name, price, wishlist toggle, and add-to-cart button, using cart and wishlist contexts from the App.",
  "frontend/src/data/products.ts": "Defines the Product TypeScript interface and exports a static array of product data across four categories (soap-making, candle-making, resin-art, fragrance) with pricing, stock, and metadata.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, configures Tailwind with a luxury OKLCH color palette (ivory, gold, charcoal), and defines utility classes for the BONITARA brand theme.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "An admin dashboard page with tabs for overview, products, orders, and inquiries that verifies the caller's admin role via the ICP actor before rendering management UI with mock order and inquiry data.",
  "frontend/src/pages/BlogListingPage.tsx": "Renders a grid listing of all blog posts from the data source, displaying each post's image, category, date, title, and excerpt with a link to the individual post page.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post by ID with a hero image, full content, tags, and a related posts section; shows a not-found fallback if the post doesn't exist.",
  "frontend/src/pages/CartPage.tsx": "Shows the shopping cart with item list, quantity controls, remove/clear actions, and an order summary panel with shipping calculation and a checkout button.",
  "frontend/src/pages/CategoryPage.tsx": "Displays a product category page with a hero banner, sortable/filterable product grid (by price and name), and a collapsible filter panel with a max-price range slider.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout form collecting shipping address and payment method selection, with a simulated order submission that shows an order confirmation screen on success.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with business info (email, phone, address, hours), social media links, a map placeholder, and a contact form that shows a success state after simulated submission.",
  "frontend/src/pages/FAQPage.tsx": "Renders a FAQ page for BONITARA with 10 accordion items covering topics like order minimums, shipping, wholesale pricing, and returns. Includes a footer prompt to contact support.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring a hero banner, best-seller product grid, category highlights, 'why us' feature cards, a review carousel, and a newsletter signup form.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays a list of mock past orders with status badges for authenticated users, and shows a login prompt for unauthenticated users.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows a detailed product page with image gallery, pricing, quantity selector, add-to-cart/wishlist actions, tabbed description/usage/specs sections, and related products.",
  "frontend/src/pages/ProfilePage.tsx": "User account page showing profile details form, wishlist items, and order navigation for authenticated users, with a logout button that clears identity and query cache.",
  "frontend/src/pages/ReturnPolicyPage.tsx": "Static return and refund policy page outlining eligibility, non-returnable items, damaged item claims, and the refund process with summary icon cards.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Displays BONITARA's shipping policy page with summary cards and detailed sections covering processing time, delivery timeframes, shipping charges, peak season delays, order tracking, and damaged/lost shipment handling.",
  "frontend/src/pages/TermsPage.tsx": "Renders BONITARA's Terms & Conditions page with eight sections covering website use, pricing, product information, intellectual property, usage disclaimers, liability limits, privacy, and governing law.",
  "frontend/src/pages/WholesalePage.tsx": "Wholesale/bulk order page showing tiered discount pricing (15–45% off), feature highlights (MOQ, custom packaging, private label, dedicated support), and a contact form for wholesale inquiries.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters (supporting both standard and hash-based routing), persist them to sessionStorage, retrieve them with URL-first fallback, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens (gold, ivory, charcoal, semantic UI colors via oklch), custom fonts (Cormorant Garamond, Jost), box shadows, border radii, and keyframe animations for the BONITARA frontend.",
  "project_state.json": "Tracks the full project state for the BONITARA luxury eCommerce website, including feature list, architectural notes, image requirements, known issues, and schema version. Serves as the build plan reference for all pages, integrations, and UI specifications."
}