{
  "backend/main.mo": "Main Motoko actor for the BONITARA backend, implementing user registration/login, admin authentication, product management, reviews, and role-based access control using a mixin authorization pattern.",
  "feature_evidence.json": "Feature evidence report confirming that the 'Add New Product' modal in AdminDashboardPage.tsx was updated to use a solid white background (`bg-white`) for clear form visibility.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of all frontend source files, serving as a reference document for the project's page and component structure.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the BONITARA React SPA, mounting the app into a `#root` div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up CartContext and WishlistContext providers, implements a hash-based client-side router, and renders all page components with a shared Header and Footer.",
  "frontend/src/components/Footer.tsx": "Site footer component with brand info, social media links, and three navigation columns (Quick Links, Policies, Account) using hash-based routing hrefs.",
  "frontend/src/components/Header.tsx": "Sticky responsive header with logo, desktop category dropdown, navigation links, cart/wishlist badge counts, and Internet Identity authentication menu with mobile drawer support.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card with image, wishlist toggle, add-to-cart overlay, star rating, and price, linking to the product detail page.",
  "frontend/src/components/ProtectedRoute.tsx": "Guards routes by checking Internet Identity or manual auth state, redirecting unauthenticated users to the login page.",
  "frontend/src/components/ReviewForm.tsx": "Form component for submitting a product review with star rating, author name, optional title, and body, using the useSubmitReview hook.",
  "frontend/src/components/ReviewsList.tsx": "Displays a list of product reviews with average rating summary, individual review cards, loading skeletons, and empty/error states.",
  "frontend/src/components/StarRating.tsx": "Provides two reusable star components: StarRatingDisplay for read-only ratings and StarRatingSelector for interactive hover-and-click rating input.",
  "frontend/src/data/products.ts": "Defines the Product interface and exports a static array of product data across soap-making, candle-making, resin-art, and fragrance categories.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor via React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status. Also exports an `InternetIdentityProvider` component to wrap the app.",
  "frontend/src/hooks/useManualAuth.ts": "Implements email/password authentication backed by the canister actor, persisting session to localStorage. Exposes login, register, and logout functions along with loading and error state.",
  "frontend/src/hooks/useProductReviews.ts": "Provides React Query hooks to fetch reviews for a specific product and to fetch average ratings for all products from the canister actor.",
  "frontend/src/hooks/useSubmitReview.ts": "Provides a React Query mutation hook to submit a product review via the canister actor, invalidating related review and rating caches on success.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS custom properties for a luxury warm-toned design system, custom animations, and scrollbar styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for overview, products, orders, and inquiries, supporting product CRUD operations (add, edit, delete) via canister actor mutations and React Query.",
  "frontend/src/pages/BlogListingPage.tsx": "Displays a grid of blog post cards sourced from static data, with category, date, and excerpt, linking to individual post pages.",
  "frontend/src/pages/BlogPostPage.tsx": "Renders a single blog post by ID with a hero image, full content, tags, and a related posts section, falling back to a not-found message if the post doesn't exist.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart with item list, quantity controls, remove buttons, and an order summary showing subtotal, shipping, and total. Shows an empty state with a shop link when the cart has no items.",
  "frontend/src/pages/CategoryPage.tsx": "Fetches and displays products for a given category from the backend actor, with a banner image, price range filter, and sort options. Maps URL slugs to backend category names and renders products as a grid of ProductCards.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders a checkout form collecting shipping address and payment method selection (Razorpay, Stripe, UPI), then simulates order placement and shows a confirmation screen with a generated order ID.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact page with business info (email, phone, address, hours), social media links, a map placeholder, and a contact form that simulates submission with a success toast.",
  "frontend/src/pages/FAQPage.tsx": "Renders a static FAQ page using an accordion component with 10 predefined questions and answers covering ordering, shipping, wholesale, returns, and product details.",
  "frontend/src/pages/HomePage.tsx": "The main landing page for the Bonitara storefront, featuring a hero slider, category grid, featured products fetched from the backend actor, feature highlights, testimonials, and a newsletter signup section.",
  "frontend/src/pages/LoginPage.tsx": "Login page supporting two authentication methods—email/password (manual) and Internet Identity—with tab switching, form validation, error display, and redirect to profile on success.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays a list of mock past orders with status badges (delivered, shipped, processing, cancelled) for authenticated users; redirects unauthenticated users to the login page.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page that fetches a single product by ID, displays images, pricing, quantity selector, add-to-cart/wishlist actions, reviews, and related products in a tabbed layout.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page for Internet Identity-authenticated users, supporting profile creation/editing via backend mutations, and tabbed views for profile info, wishlist, and orders.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page with two tabs: email/password manual registration and Internet Identity login. Validates form inputs, calls manualRegister or II login, and redirects to /profile on success.",
  "frontend/src/pages/ReturnPolicyPage.tsx": "Static informational page displaying BONITARA's return and refund policy, including eligibility criteria, non-returnable items, damage claims, and refund process details.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static informational page outlining BONITARA's shipping policy, covering processing times, delivery timeframes, shipping charges, peak season delays, and order tracking.",
  "frontend/src/pages/TermsPage.tsx": "Static legal page rendering BONITARA's Terms & Conditions across eight sections including usage, pricing, IP, liability, and governing law.",
  "frontend/src/pages/WholesalePage.tsx": "Wholesale page displaying bulk pricing tiers, program features, and a contact/inquiry form for businesses; simulates form submission with a toast notification on success.",
  "frontend/src/pages/WishlistPage.tsx": "React page component that displays the user's wishlist, showing saved products in a grid with options to remove items or add them to the cart, and an empty state with a link to continue shopping.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL/hash query parameters, persist them in sessionStorage, and clean sensitive params from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (oklch-based design tokens, gold, ivory, charcoal), fonts, border radii, shadows, and keyframe animations for the frontend.",
  "project_state.json": "Project state metadata file tracking version, existing features, and a fix request to replace the semi-transparent background of the Admin 'Add New Product' modal with a solid white background."
}