{
  "backend/main.mo": "Main Motoko actor implementing user registration/login, admin authentication, user profile management, role-based access control, and a product review system with CRUD operations.",
  "backend/migration.mo": "Migration module that transforms the old actor state (with plain adminUsername/adminPassword fields) into the new state shape that includes a credentialsMap and structured adminCredentials record.",
  "feature_evidence.json": "Feature evidence report listing implemented features (manual email/password auth system and responsive layout pass) with associated file paths, component dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of every frontend source file, describing each page and component's purpose and key implementation details.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a `#root` div and loading the TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that defines Cart and Wishlist contexts/hooks, imports all page components, and implements a hash-based client-side router mapping URL segments to page components.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, social media links, and grouped navigation links for quick links, policies, and account pages.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop/mobile navigation, a shop categories dropdown, cart/wishlist counters, and user authentication controls supporting both Internet Identity and manual auth.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, badges, wishlist toggle, add-to-cart overlay, dynamic star rating, and a link to the product detail page.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to the login page, showing a spinner while authentication state is initializing.",
  "frontend/src/components/ReviewForm.tsx": "Form component for submitting product reviews with star rating, author name, optional title, and review body, using the useSubmitReview hook and showing success/error states.",
  "frontend/src/components/ReviewsList.tsx": "Displays a list of product reviews fetched via useProductReviews, showing an aggregate rating summary, individual review cards, and loading/empty/error states.",
  "frontend/src/components/StarRating.tsx": "Provides two reusable star rating components: StarRatingDisplay for read-only rendering and StarRatingSelector for interactive hover-and-click rating input.",
  "frontend/src/data/products.ts": "Defines the Product interface and exports a static array of products across four categories (soap-making, candle-making, resin-art, fragrance) with full details including pricing, stock, specifications, and metadata.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useManualAuth.ts": "Hook for email/password-based authentication that calls backend actor methods for login, registration, and admin checks, persisting session state in localStorage.",
  "frontend/src/hooks/useProductReviews.ts": "Exports two React Query hooks: useProductReviews for fetching reviews for a single product, and useAllProductRatings for fetching average ratings across all products from the backend actor.",
  "frontend/src/hooks/useSubmitReview.ts": "Mutation hook that submits a product review via the backend actor and invalidates the relevant review and rating queries on success.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS with custom OKLCH-based design tokens for light/dark themes, and defines utility classes and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with a login gate using actor.adminCheck, displaying mock stats, products, orders, and inquiries across tabbed sections after successful authentication.",
  "frontend/src/pages/BlogListingPage.tsx": "Renders a grid listing of all blog posts from the data source, displaying each post's image, category, date, title, and excerpt with a link to the individual post page.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post by ID with a hero image, full content, tags, and a related posts section; shows a not-found fallback if the post doesn't exist.",
  "frontend/src/pages/CartPage.tsx": "Shows the shopping cart with item list, quantity controls, remove/clear actions, shipping calculation, and an order summary with a checkout button.",
  "frontend/src/pages/CategoryPage.tsx": "Displays a product category page with a hero banner, sortable/filterable product grid (by price and sort order), and a filter panel with a price range slider.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout form collecting shipping address and payment method (Razorpay, Stripe, UPI), simulates order placement, and shows an order confirmation screen on success.",
  "frontend/src/pages/ContactPage.tsx": "Contact page displaying business info (email, phone, address, hours), social media links, a map placeholder, and a contact form with simulated submission and toast notification.",
  "frontend/src/pages/FAQPage.tsx": "Renders a FAQ page for BONITARA with 10 accordion-style Q&A items covering ordering, shipping, wholesale, and returns. Includes a footer prompt to contact support if questions remain unanswered.",
  "frontend/src/pages/HomePage.tsx": "Renders the main landing page with an auto-advancing hero slider, category grid, feature highlights, product best-sellers, testimonials, and a newsletter signup form.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login page with two tabs: email/password manual login and Internet Identity (ICP) login, redirecting authenticated users to the profile page.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays a list of mock past orders with status badges (delivered, shipped, processing, cancelled) for authenticated users, or a sign-in prompt for unauthenticated users.",
  "frontend/src/pages/ProductDetailPage.tsx": "Renders a full product detail view with image, quantity selector, add-to-cart/wishlist actions, live reviews fetched from the backend, and a related products section.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile page with tabs for profile info, wishlist, and orders, supporting both Internet Identity and manual auth users with edit and setup functionality via React Query mutations.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page offering two sign-up methods—email/password and Internet Identity—with form validation, error display, and redirect to profile on success.",
  "frontend/src/pages/ReturnPolicyPage.tsx": "Static informational page detailing BONITARA's return and refund policy, including eligibility, non-returnable items, damage claims, and refund timelines.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static informational page outlining BONITARA's shipping policy, covering processing times, delivery timeframes, charges, peak-season delays, and order tracking.",
  "frontend/src/pages/TermsPage.tsx": "Static legal page rendering BONITARA's Terms & Conditions across sections such as pricing, intellectual property, liability, and governing law.",
  "frontend/src/pages/WholesalePage.tsx": "React page for BONITARA's wholesale/bulk ordering section, displaying pricing tiers, features, and a contact inquiry form with simulated submission and toast notification.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters (supporting both standard and hash-based routing), persist them in sessionStorage, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the project's custom color palette (gold, ivory, charcoal), typography (Cormorant Garamond, Jost), shadows, animations, and plugin setup for the BONITARA luxury eCommerce frontend.",
  "project_state.json": "Project state manifest (version 21) describing BONITARA's full feature set, architectural decisions, known bugs (routing, scroll, mobile menu, login regressions), and existing implemented features for build planning."
}