{
  "backend/main.mo": "Main Motoko actor for the Bonitara backend, implementing user registration/login, admin authentication, product management, and product reviews with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report linking the admin routing fix (rendering AdminLoginPage/AdminDashboardPage at /admin routes) to specific files and components with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing each page and component's purpose, key imports, and notable implementation details.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the Bonitara SPA, mounting the React app at the #root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component providing CartContext and WishlistContext, a hash-based router that maps URL paths to page components, and special handling to render admin routes without the main Header/Footer.",
  "frontend/src/components/AdminProtectedRoute.tsx": "Route guard component that checks sessionStorage for an active admin session and redirects to /admin/login if none is found, showing a spinner while checking.",
  "frontend/src/components/Footer.tsx": "Site footer component with brand info, social links, and four navigation columns (Quick Links, Policies, Account) using hash-based hrefs.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop/mobile navigation, category dropdown, cart/wishlist icon badges, and Internet Identity login/logout functionality.",
  "frontend/src/components/ProductCard.tsx": "Reusable product card displaying image, name, price, star rating, wishlist toggle, and out-of-stock badge, with category-to-slug and image URL resolution helpers.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to /login, supporting both Internet Identity and manual auth, with a loading spinner during initialization.",
  "frontend/src/components/ReviewForm.tsx": "Form component for submitting product reviews with star rating, author name, optional title, and body fields, using the useSubmitReview mutation hook.",
  "frontend/src/components/ReviewsList.tsx": "Displays a list of product reviews with average rating summary, individual review cards, loading skeletons, and an empty state, fetched via useProductReviews.",
  "frontend/src/components/StarRating.tsx": "Provides two star rating components: StarRatingDisplay for read-only rendering and StarRatingSelector for interactive hover-and-click rating input.",
  "frontend/src/data/products.ts": "Static product catalog defining the Product interface and an array of hardcoded products across soap-making, candle-making, resin-art, and fragrance categories with full metadata.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider component, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useManualAuth.ts": "Hook for email/password-based authentication that calls backend actor methods for login and registration, persisting session state in localStorage.",
  "frontend/src/hooks/useProductReviews.ts": "Provides React Query hooks to fetch reviews for a specific product and to fetch average ratings for all products from the backend actor.",
  "frontend/src/hooks/useSubmitReview.ts": "React Query mutation hook that submits a product review via the backend actor and invalidates related review and rating queries on success.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS with custom CSS variables for a luxury/gold design system, and defines animations and scrollbar styles.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for managing products (CRUD operations), orders, reviews, and analytics, using React Query for data fetching and mutations against the backend actor.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page that authenticates against the backend actor's adminCheck method, falling back to hardcoded credentials, and stores the session in sessionStorage on success.",
  "frontend/src/pages/BlogListingPage.tsx": "Renders a grid listing of all blog posts from the data source, displaying each post's image, category, date, title, and excerpt with a link to the full post.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post by ID with a hero image, full content, tags, and a related posts section; shows a not-found fallback if the post doesn't exist.",
  "frontend/src/pages/CartPage.tsx": "Shows the shopping cart with item list, quantity controls, remove buttons, shipping calculation, and a link to checkout; displays an empty-cart state when no items are present.",
  "frontend/src/pages/CategoryPage.tsx": "Fetches all products from the backend and filters them by category slug, displaying them in a sortable product grid with a banner image and breadcrumb navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page with a shipping address form, payment method selection, and order summary; simulates order placement and shows a confirmation screen on success.",
  "frontend/src/pages/ContactPage.tsx": "Contact page displaying business info (email, phone, address, hours) and social links alongside a contact form that simulates submission and shows a success toast.",
  "frontend/src/pages/FAQPage.tsx": "Renders a FAQ page for BONITARA with 10 hardcoded Q&A items displayed in an accordion layout, plus a contact prompt at the bottom.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring an auto-advancing hero slider, category grid, featured products fetched from the backend, testimonials, and a features/benefits strip.",
  "frontend/src/pages/LoginPage.tsx": "Login page that uses Internet Identity for passwordless authentication, redirecting to the profile page on success and showing sign-in/sign-up buttons.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays a list of mock orders with status badges (delivered, shipped, processing, cancelled) for authenticated users, with a sign-in prompt for unauthenticated users.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page that fetches a single product by ID from the backend, displays its image, price, and description, and includes add-to-cart, wishlist, quantity selection, and a reviews section.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile page with tabs for profile info, wishlist, and orders, supporting profile creation and editing via backend mutations.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page supporting both email/password signup and Internet Identity login, with form validation and redirect to profile on success.",
  "frontend/src/pages/ReturnPolicyPage.tsx": "Static informational page displaying BONITARA's return and refund policy, including eligibility, non-returnable items, damage claims, and refund process.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Static informational page detailing BONITARA's shipping policy, including processing times, delivery timeframes, charges, and order tracking.",
  "frontend/src/pages/TermsPage.tsx": "Static page rendering BONITARA's Terms & Conditions across sections covering website use, pricing, IP, liability, privacy, and governing law.",
  "frontend/src/pages/WholesalePage.tsx": "Renders the BONITARA wholesale/bulk orders page with pricing tiers, feature highlights, and a contact inquiry form that simulates submission with a toast notification.",
  "frontend/src/pages/WishlistPage.tsx": "Displays the user's saved wishlist items in a product grid with options to remove items or add them to the cart, and shows an empty state when no items are saved.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL/hash query parameters, persisting them to sessionStorage, and cleaning sensitive params from the address bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (gold, ivory, charcoal), fonts (Cormorant Garamond, Jost), shadows, animations, and plugin setup for typography, container queries, and animate.",
  "project_state.json": "Tracks project metadata for BONITARA including existing features, known issues (admin route not rendering correctly), and configuration for the current fix request."
}