{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin panel routing so /admin opens correctly",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the routing configuration in App.tsx so that navigating to /admin correctly renders AdminLoginPage (or AdminDashboardPage if authenticated), ensuring the hash-based router handles /admin and all sub-routes without falling through to 404 or blank screen",
      "acceptanceCriteria": [
        "Navigating to /#/admin (or /admin depending on router mode) opens the AdminLoginPage without a blank screen or 404.",
        "After entering valid admin credentials on AdminLoginPage, the user is redirected to AdminDashboardPage.",
        "AdminProtectedRoute correctly guards the dashboard and redirects unauthenticated users to the admin login page.",
        "The admin route does not render the shared Header and Footer components, consistent with the existing exclusion logic in App.tsx.",
        "All other existing routes continue to work correctly after the fix."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Fix the hash-based router configuration to correctly handle /admin and /admin/dashboard routes. Ensure the route definitions include explicit Routes for /admin (pointing to AdminLoginPage) and /admin/dashboard (wrapped with AdminProtectedRoute pointing to AdminDashboardPage). Update the conditional logic that determines whether to show Header and Footer so that it excludes all /admin/* paths. Verify that the router's path matching correctly handles both top-level /admin and nested /admin/dashboard without falling through to the catch-all 404 route."
        },
        {
          "path": "frontend/src/components/AdminProtectedRoute.tsx",
          "operation": "modify",
          "description": "Review and ensure the AdminProtectedRoute component correctly checks sessionStorage for the admin session key and redirects unauthenticated users to /admin (the admin login page). Verify the redirect logic uses the correct hash-based navigation (e.g., window.location.hash = '#/admin') to match the router mode used in App.tsx. Ensure the component returns null or a loading spinner while checking the session, then renders children only if authenticated."
        },
        {
          "path": "frontend/src/pages/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "Verify that after successful admin login (when credentials match and sessionStorage is set), the page redirects to /#/admin/dashboard using hash-based navigation (e.g., window.location.hash = '#/admin/dashboard'). Ensure the redirect logic does not conflict with the router and that the admin session flag is persisted correctly in sessionStorage before navigation occurs."
        }
      ]
    }
  ]
}